backend/app/controllers/auth/google_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "name", "created_at", "updated_at", "phone") VALUES ('anaclimgo@gmail.com', '$2a$12$1gIYLDq5VcTdFojDDNlkN.41mlt3CejzRMCu8eHQ8PCj5gDfn.RJ2', NULL, NULL, NULL, 'Ana Gomes', '2025-10-25 19:23:07.895120', '2025-10-25 19:23:07.895120', NULL) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'anaclimgo@gmail.com' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."email" = 'anaclimgo@gmail.com' LIMIT 1
---
  def create
    email = params[:email]
    name = params[:name]
    google_id = params[:google_id]

    Rails.logger.info "Google auth attempt for email: #{email}, name: #{name}"

    return render json: { error: 'Email é obrigatório' }, status: :bad_request if email.blank?
    return render json: { error: 'Nome é obrigatório' }, status: :bad_request if name.blank?

    begin
      # Find or create user
      user = User.find_or_create_by(email: email) do |u|
        u.name = name
        u.password = SecureRandom.hex(16) # Generate random password for Google users
        u.password_confirmation = u.password
      end

      Rails.logger.info "User found/created: #{user.persisted?}, ID: #{user.id}"

      if user.persisted?
        begin
          # Use the same approach as the working login endpoint
          sign_in(user)
          Rails.logger.info "User signed in successfully"

          # Get the JWT token from the request environment
          token = request.env['warden-jwt_auth.token']
          Rails.logger.info "JWT token from warden: #{token.present? ? 'YES' : 'NO'}"