backend/app/controllers/api/tcc_controller.rb

  def set_tcc
    @tcc = current_user.tccs.find(params[:id])
---
SELECT "tccs".* FROM "tccs" WHERE "tccs"."user_id" = 2 AND "tccs"."id" = NULL LIMIT 1