backend/app/controllers/api/work_content_controller.rb

  def set_work
    Rails.logger.info "=== SET_WORK CALLED ==="
    Rails.logger.info "Setting work for ID: #{params[:id]}"
    Rails.logger.info "Current user: #{current_user&.id}"

    # Handle both legacy string IDs and database integer IDs
    if params[:id].to_s.start_with?('tcc-')
      Rails.logger.info "Handling legacy TCC ID: #{params[:id]}"
      # Legacy string ID format - create a new TCC record for this user
      # This ensures proper multi-tenant isolation
      begin
        @work = current_user.tccs.find_or_create_by(tema: "Trabalho Acadêmico - #{params[:id]}") do |tcc|
---
INSERT INTO "tccs" ("nome", "faculdade", "curso", "materia", "tema", "tipo_trabalho", "user_id", "created_at", "updated_at", "resumo", "introducao", "objetivos", "justificativa", "metodologia", "desenvolvimento", "conclusao", "referencias") VALUES ('Ana Gomes', 'Instituição', 'Curso', NULL, 'Trabalho Acadêmico', 'TCC', 2, '2025-10-25 19:31:42.605870', '2025-10-25 19:31:42.605870', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"
SELECT "tccs".* FROM "tccs" WHERE "tccs"."user_id" = 2 AND "tccs"."tema" = 'Trabalho Acadêmico - tcc-1761418584082' LIMIT 1